FinPulse/src/Documents/Документ/Документ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Документ</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </attributes>
  <attributes>
    <name>СчётПолучателя</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </attributes>
</mdclass:Document>

FinPulse/src/Enums/ТипДДС/ТипДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДДС</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Перевод</name>
  </enumValues>
</mdclass:Enum>

FinPulse/src/Documents/Документ/Forms/ИзменениеСтатьиДДС/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	Элементы.СчётПолучателя.Видимость = ЭтоПеревод(Объект.СтатьяДДС);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ЭтоПеревод(СтатьяСсылка)

    Если Не ЗначениеЗаполнено(СтатьяСсылка) Тогда
        Возврат Ложь;
    КонецЕсли;

    Статья = СтатьяСсылка.ПолучитьОбъект();

     Возврат Статья.ТипДДС = ПредопределенноеЗначение("Перечисление.ТипДДС.Перевод");

КонецФункции
#КонецОбласти
